# ForwardIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroundConductorSizeSet..::..ForwardIterator Method
GroundConductorSizeSet Class See Also
---
Retrieve a forward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual GroundConductorSizeSetIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As GroundConductorSizeSetIterator
```

Visual C++
---
```text
public:
virtual GroundConductorSizeSetIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the set.
# See Also
GroundConductorSizeSet Class
Autodesk.Revit.DB.Electrical Namespace